import streamlit as st
import random

st.set_page_config(page_title="Dormitory children's menu", page_icon=":🍜:")
st.image('fresh And tasty Food any Time.png')

#page_bg_img = '''<style> .stApp { background-image: url("https://picsum.photos/1080/768"); background-size: cover; } </style>''' 
#st.markdown(page_bg_img, unsafe_allow_html=True)



page_bg_img = '''
<style>
[data-testid="stAppViewContainer"] {
background-color: #DCDCDC;
</style
'''
st.markdown(page_bg_img, unsafe_allow_html=True)

#โค้ดที่ใช้ css
def local_css(file_name):
    with open(file_name) as f:
        st.markdown(f"<style>{f.read()}</style>", unsafe_allow_html=True)


local_css("style/style.css")




def khao1():
 import streamlit as st
 
 st.title('7 เมนูอาหารสำหรับเด็กหอ')
 st.write('สำหรับชาวหอ หรือชาวคอนโดแล้ว การเข้าครัวทำกับข้าว บางทีเครื่องครัวก็อาจจะไม่พร้อม หรือใดๆ  วันนี้เรามี สูตรอาหาร ทำง่าย ทำได้สะดวกในครัวหอพักมาฝากกัน กับ 7 สูตรอาหาร เมนูเด็กหอ รับรองว่าทำง่ายๆ ในห้อง ไม่ต้องคิดเยอะ แถมใช้เวลาไม่นาน ขั้นตอนไม่ยุ่งยากก็อร่อยได้แล้ว แล้วเมนูที่ว่ามานี้จะมีอะไรบ้าง มาดูกันเลย!!!')
 #st.markdown("[อ่านเพิ่มเติม >](https://th.theasianparent.com/6-healthy-vegetables)")
 st.write('##')


 st.subheader('1.ข้าวผัดมาม่า')
 st.write('##')
 col1, col2 = st.columns(2 , gap = 'small')
 col2.image('Khaophat Ma Ma.jpg')
 col1.write('  ใครอยู่หอมามุงด่วน! เราจะมาแจกสูตรอาหาร เมนูเด็กหอ ข้าวผัดมาม่า ทำง่าย ไม่ต้องใช้เครื่องปรุงเพิ่ม แค่มีข้าวสวย กับมาม่า 1 ห่อ และไข่หนึ่งฟอง ก็ได้เมนูข้าวผัดมาม่าแสนอร่อย รสชาตินัวๆ แล้ว บอกเลยว่าถูกใจเด็กหอแน่นอน หรือจะเป็นเมนูแสนประหยัดสำหรับช่วงสิ้นเดือนก็ได้นะ เพราะทั้งหมดนี้แทบไม่ต้องใช้เงินเลยจ้า ข้าวผัดมาม่าที่ว่ามีวิธีทำอย่างไร ไปดูพร้อมๆ กันเลย!')
 #col1.markdown("[ดูขั้นตอนทำได้ที่นี้ จิ้มๆ](https://youtu.be/qx8SFEBmN2w?si=1gSzyEaEsGKM_DG6)")
 col1.link_button("ดูขั้นตอนทำได้ที่นี้ จิ้มๆ","https://youtu.be/RV0MxevgalU ")
 st.write('##')
 #st.write('ส่วนผสมและเครื่องปรุง 1.บะหมี่กึ่งสำเร็จรูปรสต้มยำกุ้งน้ำข้น(หรือตามใจชอบ) 2 ห่อ 2. ไข่ไก่ 4 ฟอง 3. ข้าวสวย 350 กรัม')
 st.write('##')

 st.subheader('2.ยำปลากระป๋อง')
 st.write('##')
 col1, col2 = st.columns(2 , gap = 'small')
 col1.write('ปลากระป๋อง อีกหนึ่งวัตถุดิบติดบ้าน เมนูคู่ครัวไทย และสำหรับใครที่กำลังหาเมนูอร่อยๆ ทำง่ายๆ ที่ราคาประหยัด และใช้เวลาไม่นานก็กินได้แล้ว วันนี้เรามี สูตรอาหาร เมนูเด็ด สูตรทำ ยำปลากระป๋อง มาฝากค่ะ บอกเลยว่าสูตรนี้อร่อยจัดจ้าน ไม่แพ้ไปกินที่้านอาหาร แถมยังเป็น เมนูราคาประหยัด อร่อยได้ ในงบไม่เกิน 100 บาท ทานกับข้าวสวยร้อนๆ ก็อิ่มได้ทั้งครอบครัว เอาล่ะตามเรามาดูกันเลยดีกว่าค่ะว่าวิธีทำ ยำปลากระป๋อง มีขั้นตอนอะไรบ้าง')
 #col1.markdown("[ดูขั้นตอนทำได้ที่นี้ จิ้มๆ](https://youtu.be/Y7qO_7Gvsfk)")
 col1.link_button("ดูขั้นตอนทำได้ที่นี้ จิ้มๆ","https://youtu.be/Y7qO_7Gvsfk")
 
 col2.image('Yam Pla Krapong.jpg')
 st.write('##')


 st.subheader('3.ข้าวมันไก่')
 st.write('##')
 col1, col2 = st.columns(2 , gap = 'small')
 col1.write(' แจกสูตรอาหาร ข้าวมันไก่หม้อหุงข้าว ทำเองได้ง่ายๆ ที่บ้าน! ข้าวมันไก่ เมนูยอดฮิตของคนไทย ที่หลายคนอาจจะคิดว่าทำยาก หาซื้อกินน่าจะง่ายกว่า แต่จริงๆ แล้ว ข้าวมันไก่ทำไม่ยากอย่างที่คิด ใช้ส่วนผสมเพียงไม่กี่อย่าง และหม้อหุงข้าวจากที่บ้าน ก็สามารถทำข้าวมันไก่หอมนุ่ม กลมกล่อมที่บ้านได้แล้ว มาพร้อมกับสูตรน้ำจิ้มข้าวมันไก่รสเด็ด ทำเองไม่ต้องง้อแม่ค้า กินเท่าไหร่ก็ได้ ฟินนนน!')
 col2.image('khaomankai.jpg')
 #col1.markdown("[ดูขั้นตอนทำได้ที่นี้ จิ้มๆ](https://fb.watch/qyhT0XZx__/")
 col1.link_button("ดูขั้นตอนทำได้ที่นี้ จิ้มๆ","https://fb.watch/qIWTEu2mqO/")

 st.write('##')

 st.subheader('4.สุกี้น้ำดำ')
 st.write('##')
 col1, col2 = st.columns(2 , gap = 'small')
 col1.write('    เพื่อน ๆ คนไหนกำลังอยากจะหาเมนูสำหรับฉลองปีใหม่กับชาวแก๊งอยู่ล่ะก็ ต้องลอง “สุกี้น้ำดำ” หม้อนี้เลย ทำง่าย อิ่มสะดวก จะเพิ่มเติมวัตถุดิบอะไรตามชอบก็แล้วแต่ใจพวกเธอเลย! เพราะรสชาติน้ำซุปแสนกลมกล่อม จะใส่อะไรก็อร่อย เพียงแค่มีเตากับหม้อก็พร้อมลุย! ')
 col2.image('Suki Nam Dam.jpg')
 #col1.markdown("[ดูขั้นตอนทำได้ที่นี้ จิ้มๆ](https://fb.watch/qyizB6Pqvc/)")
 col1.link_button("ดูขั้นตอนทำได้ที่นี้ จิ้มๆ","https://fb.watch/qyizB6Pqvc/")

 st.write('##')
 #st.write('ส่วนผสมและเครื่องปรุง 1.บะหมี่กึ่งสำเร็จรูปรสต้มยำกุ้งน้ำข้น(หรือตามใจชอบ) 2 ห่อ 2. ไข่ไก่ 4 ฟอง 3. ข้าวสวย 350 กรัม')


 st.subheader('5.ปีกไก่ทอดน้ำปลา ')
 st.write('##')
 col1, col2 = st.columns(2 , gap = 'small')
 col1.write(' สูตรทำ ปีกไก่ทอดน้ำปลา ที่วันนี้ไม่ได้มาแบบเหงาๆ แค่ไก่ทอดอย่างเดียว แต่ควงคู่มาพร้อมกับ สูตรทำน้ำจิ้มแจ่ว บอกเลยว่ากินคู่กัน อร่อย ลงตัว กำลังดี เด็กกินได้ ผู้ใหญ่กินดี ฟินกันทั้งครอบครัว รู้ตัวอีกทีหมดจานแน่นอนจ้าาา ถ้าอยากรู้แล้วว่าขั้นตอนและวิธีทำมีอะไรบ้าง ก็ตามเรามาดูกันเลยย ')
 #col1.markdown("[ดูขั้นตอนทำได้ที่นี้ จิ้มๆ](https://www.wongnai.com/recipes/muslim-yellow-rice-with-chicken-in-rice-cooker)")
 col1.link_button("ดูขั้นตอนทำได้ที่นี้ จิ้มๆ","https://youtu.be/OZQgLxInJCM")

 col2.image('Pik Kai Thot Nampla.jpg')
 st.write('##')



 st.subheader('6.แกงจืดสาหร่ายเต้าหู้ไข่ ไมโครเวฟ')
 st.write('##')
 col1, col2 = st.columns(2 , gap = 'small')
 col1.write(' สำหรับทุกๆ คนที่ชื่นชอบเมนูตามสั่งสุดป็อปอย่าง แกงจืดสาหร่ายเต้าหู้ไข่ ไมโครเวฟ แค่มีหม้อหุงข้าวก็สามารถทำได้แล้ว! ส่วนจะเสิร์ฟที่ไหนก็ขึ้นอยู่กับจินตนาการของคนทำ!')
 #col1.markdown("[ดูขั้นตอนทำได้ที่นี้ จิ้มๆ](https://fb.watch/qypEM8FyLQ/)")
 col1.link_button("ดูขั้นตอนทำได้ที่นี้ จิ้มๆ","https://youtu.be/rJ6Mhi8lasw?si=eUJePQ_IxsZC5qUr") 

 col2.image('Kaengchuet Sarai Taohu Khai.jpeg')
 st.write('##')


 st.subheader('7.เกี๊ยวซ่า หม้อหุงข้าว')
 st.write('##')
 col1, col2 = st.columns(2 , gap = 'small')
 col1.write('     ใครที่กำลังมองหา สูตรอาหาร ทำง่าย อยู่ล่ะก็ ตามเรามาทางนี้เลยค่ะ โดยเฉพาะสายกรุบสายเคี้ยว ต้องการของทานเล่นในยามว่าง บอกเลยว่าเมนูนี้เด็ดดวงพวงมาลัยมาก! เพราะนี่คือ สูตรทำ เกี๊ยวซ่า หม้อหุงข้าว นั่นเองค่าาา เพียงแค่มีหม้อหุงข้าวใบเดียว ก็สามารถทำเกี๊ยวซ่าอร่อยๆ ได้แล้ว ดีต่อใจเหลือเกิน! แถมส่วนผสมของตัวเกี๊ยวซ่าก็มีไม่เยอะ ขั้นตอนการทำก็ไม่ซับซ้อน ใครที่ไม่มีเครื่องครัวเยอะๆ สามารถทำได้สบายๆ เลยจ้า รับรองว่าอร่อย ทำง่าย ติดใจต้องอยากทำอีก วิธีการจะมีอะไรบ้าง ตามเราไปดูกันเลยค่า')
 #col1.markdown("[ดูขั้นตอนทำได้ที่นี้ จิ้มๆ](https://youtu.be/-lzyHbhf8UE)")
 col1.link_button("ดูขั้นตอนทำได้ที่นี้ จิ้มๆ","https://youtu.be/-lzyHbhf8UE")
 col2.image('Kiao Sa.jpg')
 st.write('##')
 # ---- CONTACT ----
 with st.container():
    st.write("---")
    st.header("Do you have something to say to me?")
    st.write("##")


    contact_form = """
    <form action="https://formsubmit.co/YOUR@MAIL.COM" method="POST">
        <input type="hidden" name="_captcha" value="false">
        <input type="text" name="name" placeholder="Your name" required>
        <input type="email" name="email" placeholder="Your email" required>
        <textarea name="message" placeholder="Your message here" required></textarea>
        <button type="submit">Send</button>
    </form>
    """
    left_column, right_column = st.columns(2)
    with left_column:
        st.markdown(contact_form, unsafe_allow_html=True)
    with right_column:
        st.empty()
def khao2():
 import streamlit as st
 st.title('ขั้นตอนและวิธีการทำ')


 st.subheader('1.ข้าวผัดมาม่า')
 st.write('ส่วนผสม ข้าวผัดมาม่า')
 st.write (' มาม่า รสที่ชอบ ข้าวสวย ผักสด / ผักแช่แข็ง ไข่ไก่')

 st.subheader('วิธีทำ ข้าวผัดมาม่า')
 st.write('''
          1.   นำมาม่ามาทุบให้แตกทั่วกัน นำไปใส่น้ำร้อนปิดฝาไว้ให้สุก เทน้ำออก พักไว้
          2.   ตั้งกระทะ ใส่ข้าวที่เตรียมไว้ลงไปผัด ตามด้วยมาม่าที่พักไว้ ใส่ผักสด หรือผักแช่แข็งที่เตรียมไว้ ผัดให้เข้ากัน จนพอสุก
          3.   นำผงมาม่าเทใส่แทนเครื่องปรุง ผัดให้เข้ากันอีกครั้ง จากนั้นตอกไข่ใส่ 1 ฟอง ผัดจนไข่สุกและแห้งดี พร้อมจัดใส่จาน
          ''')

 st.subheader('2.ยำปลากระป๋อง')
 st.write('ส่วนผสม ยำปลากระป๋อง')
 st.write (''' ปลากระป๋อง 2 กระป๋อง
             ตะไคร้ 1 ต้น
              หอมแดง 3 หัว
             ผักชีฝรั่ง 1 ต้น
             ใบมะกรูด
             พริกแดงจินดา 3 เม็ด
             พริกป่น 1 ช้อนชา
                น้ำมะนาว 1/2 ช้อนโต๊ะ
                น้ำปลา 1/2 ช้อนโต๊ะ
             น้ำตาล 1/2 ช้อนชา
           ''')

 st.subheader('วิธีทำ ยำปลากระป๋อง')
 st.write('''
          1.   เทปลากระป๋องออกมาจากกระป๋อง แล้วแยกเนื้อปลาออกจากส่วนน้ำมะเขือเทศ
          2.   ซอยตะไคร้บางๆ ตามด้วยหอมแดง พริก ผักชีฝรั่ง และใบมะกรูด
          3.   นำน้ำปลากระป๋องมาปรุงรส ด้วย น้ำปลา น้ำตาล พริกป่น (สามารถใส่ผงชูรสได้เล็กน้อย) ตามด้วยน้ำมะนาว แล้วคนให้ส่วนผสมเข้ากัน
          4.   ใส่ตะไคร้ซอย หอมแดง พริก ผักชีฝรั่ง และใบมะกรูด (ส่วนแรก) ลงไปแล้วคนให้เข้ากัน
          5.   ราดน้ำยำลงบนปลากระป๋องที่แยกไว้ ตกแต่งหน้าด้วย ตะไคร้ซอย หอมแดง พริก ผักชีฝรั่ง และใบมะกรูด (ส่วนที่เหลือ) พร้อมเสิร์ฟ
          ''')


 st.subheader('3.ข้าวมันไก่')
 st.write('ส่วนผสม ข้าวมันไก่')
 st.write (' ข้าวหมอมะลิ 3 ถ้วย น้ำเปล่า 2.5 ถ้วย น่องติดสะโพก 400 กรัม ขิงหั่นแว่นบุบพอแตก 4-5 แว่น กระเทียมบุบ 1/4 ถ้วย รากผักชีบุบ 2-3 ราก ดอกเกลือ 1/2 ช้อนชา น้ำมันมะกอก Bertoli Extra Light 3-4 ช้อนโต๊ะ')

 st.subheader('วิธีทำ ข้าวมันไก่')
 st.write('''
          1.   เปิดหม้อหุงข้าว กดอุ่นหรือหุง ให้หม้อข้าวร้อน ใส่น้ำมันมะกอกลงไป นำกระเทียม รากผักชี ขิง ลงไปเจียว จนกลิ่นหอม
          2.   ใส่ข้าวที่ซาวไว้ใส่ลงไป ผัดจนเข้ากัน ปรุงรสด้วยดอกเกลือเล็กน้อย คนจนเข้ากัน
          3.   ใส่เนื้อไก่ลงไป เติมน้ำ และกดหุงตามปกติ
          4.   จัดเสิร์ฟคู่กับน้ำจิ้มข้าวมันไก่
          ''')


 st.subheader('4.สุกี้น้ำดำ')
 st.write('ส่วนผสม สุกี้น้ำดำ')
 st.write (' คนอร์ ซุปรสหมูก้อน 1 ก้อน  โชยุ 4 ช้อนโต๊ะ  มิริน 3 ช้อนโต๊ะ  สาเก 3 ช้อนโต๊ะ  น้ำตาลทราย 3 ช้อนโต๊ะ  หอมหัวใหญ่ หั่นเสี้ยว 1 หัว  ผักกาดขาว ตามชอบ  ต้นหอมญี่ปุ่น ตามชอบ  เห็ดหอมญี่ปุ่น ตามชอบ  แครอท ตามชอบ  เห็ดออรินจิ ตามชอบ  เห็ดเข็มทอง ตามชอบ  ข้าวโพดอ่อน ตามชอบ เต้าหู้ย่าง 1 ถาด  เนื้อหมูคุโรบูตะสไลซ์ 250 กรัม  ไข่ไก่ออร์แกนิก 1 ฟอง')

 st.subheader('วิธีทำ สุกี้น้ำดำ')
 st.write('''
          1.   ตั้งหม้อบนเตา ใส่หอมหัวใหญ่ลงไปผัดให้ขึ้นสี แล้วใส่น้ำเปล่าลงไปเมื่อน้ำเดือด ใส่ คนอร์ ซุปรสหมูก้อน ลงไปเพื่อความหอมหวาน ปรุงรสด้วย โชยุ มิริน สาเก และน้ำตาลทราย คนให้เข้ากัน 
          2.   จัดเครื่องสุกี้ เช่น ผักกาดขาว ต้นหอมญี่ปุ่น เห็ดหอมญี่ปุ่น แครอท เห็ดออรินจิ เห็ดเข็มทอง ข้าวโพดอ่อน เต้าหู้ย่าง เนื้อหมูคุโรบูตะสไลซ์ หรืออื่น ๆ ตามชอบ ลงในหม้อ 
          3.   ตอกไข่ออร์แกนิคใส่ถ้วย ตีให้เข้ากัน ใช้สำหรับจิ้มเนื้อหมูก่อนรับประทาน เท่านี้ก็พร้อมอร่อย! 
          ''')


 st.subheader('5.ปีกไก่ทอดน้ำปลา')
 st.write('ส่วนผสม ปีกไก่ทอดน้ำปลา')
 st.write (' ปีกไก่ 500 กรัม น้ำปลา 1 ช้อนโต๊ะ น้ำตาลทราย ½ ช้อนชา พริกไทย ½ ช้อนชา')
 st.write('ส่วนผสมน้ำจิ้มแจ่ว')
 st.write('น้ำมะนาว 3 ช้อนโต๊ะ น้ำปลา 3 ช้อนโต๊ะ น้ำตาลทราย 1 ช้อนชา พริกป่น 1 ช้อนโต๊ะ ข้าวคั่ว 1 ช้อนโต๊ะ หอมแดง 2 หัว ผักชีฝรั่ง 1 ถ้วย')

 st.subheader('วิธีทำ ปีกไก่ทอดน้ำปลา')
 st.write('''
          1.  นำปีกไก่มาล้างทำความสะอาด และผึ่งไว้ให้หมาด
          2. ก่อนหมักไก่ให้นำส้อมมาจิ้มปีกไก่ให้ทั่ว เพื่อให้น้ำหมักเข้าเนื้อ
          3.   ใส่น้ำปลา น้ำตาล พริกไทยป่น แล้วคลุกเข้าเข้ากัน
          4.  ใช้แรปพลาสติกปิดไว้ แล้วนำไปเข้าตู้เย็น หมักไว้ 30 นาที - 1 ชั่วโมง
          5.  ตั้งน้ำมันให้ร้อนได้ที่ ใช้ไฟกลาง ใส่ปีกไก่ที่หมักแล้วลงไปทอด ให้น้ำมันท่วมไก่
          6.  เมื่อไก่สุกได้ที่ ให้เร่งไฟเพื่อให้ปีกไก่เป็นสีเหลืองทอง และไล่น้ำมัน
          7.  เมื่อได้สีเหลืองตามต้องการ ให้นำปีกไก่ขึ้นจากกระทะ พักให้สะเด็ดน้ำมัน พร้อมรับทาน
          ''')
 st.subheader('วิธีทำ น้ำจิ้มแจ่ว')
 st.write('''
          1.   ใส่น้ำมะนาว น้ำปลา และน้ำตาลทราย ลงในถ้วย คนให้น้ำตาลละลายหมด
          2.   ใส่พริกป่น และหอมแดง คนให้เข้ากัน จากนั้นใส่ข้าวคั่ว
          3.   โรยหน้าด้วยผักชีฝรั่ง
          ''')
 st.subheader('6.แกงจืดสาหร่ายเต้าหู้ไข่ ไมโครเวฟ')
 st.write('ส่วนผสมแกงจืดสาหร่ายเต้าหู้ไข่ ไมโครเวฟ')
 st.write (' สาหร่ายทำน้ำแกง เต้าหู้ไข่ หมูสับ ผักกาดขาว ผักชี-ต้นหอม พริกไทย ซีอิ๊วขาว ผงปรุงรส น้ำเปล่า')

 st.subheader('วิธีทำ แกงจืดสาหร่ายเต้าหู้ไข่ ไมโครเวฟ')
 st.write('''
          1.   นำหมูสับ ปรุงรสด้วยซอสปรุงรสและพริกป่นเล็กน้อย แล้วนำไปเข้าไมโครเวฟ ประมาณ 30 วินาที - 1 นาที
          2.   เตรียมชาม ใส่สาหร่าย ผักกาดขาว แล้วปรุงรสด้วยพริกไทย ผงปรุงรส และซีอิ๊วขาว คนให้เข้ากัน
          3.   ใส่เต้าหู้ไข่และหมูสับลงไป พยายามกดให้เต้าหู้ไข่อยู่ด้านล่าง เพราะจะได้ไม่แห้งเวลานำเข้าไมโครเวฟ
          4.   นำชามแกงจืดไปเข้าไมโครเวฟ ใช้เวลา 15-20 นาที
          5.   นำแกงจืดออกมาคน โรยหน้าด้วยต้นหอมผักชี พร้อมเสิร์ฟ
          ''')


 st.subheader('7.เกี๊ยวซ่า หม้อหุงข้าว')
 st.write('ส่วนผสม เกี๊ยวซ่า')
 st.write (''' 
             หมูสับติดมัน
           น้ำมันหอย
             โชยุ
             น้ำมันงา
             แป้งข้าวโพด
             กระหล่ำปลีซอย
             ต้นหอมซอย
            ขิงอ่อนซอยละเอียด
            แผ่นเกี๊ยว
           ''')

 st.subheader('วิธีทำ เกี๊ยวซ่า')
 st.write('''
          1.   นำหมูสับติดมัน มาปรุงรสด้วย น้ำมันหอย โชยุ น้ำมันงา และแป้งข้าวโพด คลุกเคล้าให้เข้ากัน
          2.   ซอยกะหล่ำปลี ต้นหอม ขิงอ่อนให้ละเอียด แล้วนำไปคลุกเคล้าให้เข้ากับหมู
          3.   ตัดแผ่นเกี๊ยวให้เป็นวงกลม แล้วนำไปห่อ โดยการวางหมูไว้ตรงกลาง แล้วพับจีบข้างเดียว อีกข้างนำมาแปะไว้ แล้วกดให้ติดด้วยน้ำ
          4.   พรมน้ำบนเกี๊ยวด้วยฟอกกี้ แล้ววางเรียงใส่บนชั้นนึงของหม้อหุงข้าว
          5.   ใส่น้ำไปในหม้อหุงข้าวด้านล่าง แล้วนึ่ง ใช้เวลา 15 นาที
          6.  เมื่อสุกได้ที่แล้ว จัดเสิร์ฟ คู่กับ โชยุ
          ''')



  # ---- CONTACT ----
 with st.container():
    st.write("---")
    st.header("Do you have something to say to me?")
    st.write("##")

 
    contact_form = """
    <form action="https://formsubmit.co/pakaporn.so.66@ubu.ac.th" method="POST">
        <input type="hidden" name="_captcha" value="false">
        <input type="text" name="name" placeholder="Your name" required>
        <input type="email" name="email" placeholder="Your email" required>
        <textarea name="message" placeholder="Your message here" required></textarea>
        <button type="submit">Send</button>
    </form>
    """
    left_column, right_column = st.columns(2)
    with left_column:
        st.markdown(contact_form, unsafe_allow_html=True)
    with right_column:
        st.empty()

def khao3():
   import streamlit as st
   st.title('สุ่มหมายเลข') 
   st.write(' หากเลือกดูแล้วแต่ยังคิดไม่ออกว่าจะทำอะไรดี คุณสามารถกดที่ด้านล่างเพื่อสุ่มตัวเลข1-7ตามเมนูที่แนะนำได้เลย!')
   if st.button('สุ่มเลข'):
    # สร้างค่าสุ่ม
    random_number = random.randint(1, 7)
    # แสดงค่าสุ่ม
    st.write('หมายเลขที่ได้คือ:', random_number)



  # ---- CONTACT ----
   with st.container():
    st.write("---")
    st.header("Do you have something to say to me?")
    st.write("##")

 
    contact_form = """
    <form action="https://formsubmit.co/pakaporn.so.66@ubu.ac.th" method="POST">
        <input type="hidden" name="_captcha" value="false">
        <input type="text" name="name" placeholder="Your name" required>
        <input type="email" name="email" placeholder="Your email" required>
        <textarea name="message" placeholder="Your message here" required></textarea>
        <button type="submit">Send</button>
    </form>
    """
    left_column, right_column = st.columns(2)
    with left_column:
        st.markdown(contact_form, unsafe_allow_html=True)
    with right_column:
        st.empty()


name = {
    "หน้าแรก": khao1,
    "วิธีการทำ": khao2,
    "สุ่มหมายเลขเมนู": khao3
}
name2 = st.sidebar.selectbox("แนะนำ",name.keys())
name[name2]()


